apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_qspi.c
/****************************************************************************
 * arch/xtensa/src/esp32s3/esp32s3_qspi.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_ESP32S3_SPI

#include <assert.h>
#include <nuttx/debug.h>
#include <sys/param.h>
#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <time.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/kmalloc.h>
#include <nuttx/spi/qspi.h>

#include <arch/board/board.h>

#include "xtensa.h"
#include "hardware/esp32s3_gpio_sigmap.h"
#include "hardware/esp32s3_pinmap.h"
#include "hardware/esp32s3_spi.h"
#include "hardware/esp32s3_soc.h"
#include "hardware/esp32s3_system.h"

#include "esp_irq.h"
#include "esp_gpio.h"
#include "esp32s3_qspi.h"

#ifdef CONFIG_ESP32S3_SPI_DMA
#include "esp32s3_dma.h"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SPI_DMA

/* QSPI maximum DMA buffer size in bytes */

#define QSPI_DMA_BUFSIZE CONFIG_ESP32S3_SPI_DMA_BUFSIZE

/* QSPI DMA RX/TX number of descriptors */

#  if (QSPI_DMA_BUFSIZE % ESP32S3_DMA_BUFLEN_MAX) > 0
#    define QSPI_DMA_DESC_NUM (QSPI_DMA_BUFSIZE / ESP32S3_DMA_BUFLEN_MAX + 1)
#  else
#    define QSPI_DMA_DESC_NUM (QSPI_DMA_BUFSIZE / ESP32S3_DMA_BUFLEN_MAX)
#  endif

/* QSPI DMA reset before exchange */

#  define QSPI_DMA_RESET_MASK (SPI_DMA_AFIFO_RST_M | SPI_RX_AFIFO_RST_M)

#endif /* CONFIG_ESP32S3_SPI_DMA */

/* QSPI default frequency (limited by clock divider) */

#define QSPI_DEFAULT_FREQ   (400000)

/* QSPI default width */

#define QSPI_DEFAULT_WIDTH  (8)

/* QSPI default mode */

#define QSPI_DEFAULT_MODE   (QSPIDEV_MODE0)

/* QSPI maximum non-DMA buffer size in bytes */

#define QSPI_CMD_BUFSIZE    (64)

/* Verify whether QSPI has been assigned IOMUX pins.
 * Otherwise, QSPI signals will be routed via GPIO Matrix.
 */

#ifdef CONFIG_ESP32S3_SPI2

/* In quad QSPI mode, data IO map is:
 *    MOSI -> IO0
 *    MISO -> IO1
 *    WP   -> IO2
 *    Hold -> IO3
 */

#  define QSPI_IS_CS_IOMUX    (CONFIG_ESP32S3_SPI2_CSPIN == SPI2_IOMUX_CSPIN)
#  define QSPI_IS_CLK_IOMUX   (CONFIG_ESP32S3_SPI2_CLKPIN == SPI2_IOMUX_CLKPIN)
#  define QSPI_IS_MOSI_IOMUX  (CONFIG_ESP32S3_SPI2_MOSIPIN == SPI2_IOMUX_MOSIPIN)
#  define QSPI_IS_MISO_IOMUX  (CONFIG_ESP32S3_SPI2_MISOPIN == SPI2_IOMUX_MISOPIN)
#  define QSPI_IS_IO2_IOMUX   (CONFIG_ESP32S3_SPI2_IO2PIN == SPI2_IOMUX_WPPIN)
#  define QSPI_IS_IO3_IOMUX   (CONFIG_ESP32S3_SPI2_IO3PIN == SPI2_IOMUX_HDPIN)

#  define QSPI_VIA_IOMUX      ((QSPI_IS_CS_IOMUX) && \
                               (QSPI_IS_CLK_IOMUX) && \
                               (QSPI_IS_MOSI_IOMUX) && \
                               (QSPI_IS_MISO_IOMUX) && \
                               (QSPI_IS_IO2_IOMUX) && \
                               (QSPI_IS_IO3_IOMUX))
#else
#  define QSPI_VIA_IOMUX      0
#endif

/* Check if 16-bit command or 8 bit command and return its bits */

#define QSPI_CMD_BITS(cmd)    ((cmd) & 0xff00 ? 16 : 8)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* QSPI Device hardware configuration */

struct esp32s3_qspi_config_s
{
  uint8_t id;                 /* ESP32-S3 QSPI device ID: SPIx {2,3} */

  uint8_t cs_pin;             /* GPIO configuration for CS */
  uint8_t mosi_pin;           /* GPIO configuration for MOSI */
  uint8_t miso_pin;           /* GPIO configuration for MISO */
  uint8_t clk_pin;            /* GPIO configuration for CLK */
  uint8_t io2_pin;            /* GPIO configuration for IO2 */
  uint8_t io3_pin;            /* GPIO configuration for IO3 */

  int8_t periph;              /* Peripheral ID */
  uint8_t irq;                /* Interrupt ID */

  uint32_t clk_bit;           /* Clock enable bit */
  uint32_t rst_bit;           /* QSPI reset bit */

#ifdef CONFIG_ESP32S3_SPI_DMA

  /* Peripheral for which the DMA channel request */

  enum esp32s3_dma_periph_e dma_periph;
  uint32_t dma_clk_bit;       /* DMA clock enable bit */
  uint32_t dma_rst_bit;       /* DMA reset bit */
#endif

  uint32_t cs_insig;          /* QSPI CS input signal index */
  uint32_t cs_outsig;         /* QSPI CS output signal index */
  uint32_t mosi_insig;        /* QSPI MOSI input signal index */
  uint32_t mosi_outsig;       /* QSPI MOSI output signal index */
  uint32_t miso_insig;        /* QSPI MISO input signal index */
  uint32_t miso_outsig;       /* QSPI MISO output signal index */
  uint32_t clk_insig;         /* QSPI CLK input signal index */
  uint32_t clk_outsig;        /* QSPI CLK output signal index */
  uint32_t io2_insig;         /* QSPI IO2 input signal index */
  uint32_t io2_outsig;        /* QSPI IO2 output signal index */
  uint32_t io3_insig;         /* QSPI IO3 input signal index */
  uint32_t io3_outsig;        /* QSPI IO3 output signal index */
};

