apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_qspi.c
struct esp32s3_qspi_priv_s
{
  /* Externally visible part of the (Q)QSPI interface */

  struct qspi_dev_s spi_dev;

  /* Port configuration */

  const struct esp32s3_qspi_config_s *config;

  int refs;               /* Reference count */
  mutex_t lock;           /* Held while chip is selected for mutual exclusion */

#ifdef CONFIG_ESP32S3_SPI_DMA
  sem_t sem_isr;          /* Interrupt wait semaphore */

  int cpu;                /* CPU ID */
  int cpuint;             /* QSPI interrupt ID */

  int32_t dma_channel;    /* Channel assigned by the GDMA driver */

  /* DMA description */

  struct esp32s3_dmadesc_s *dma_desc;
#endif

  uint32_t frequency;     /* Requested clock frequency */
  uint32_t actual;        /* Actual clock frequency */
  enum qspi_mode_e mode;  /* Actual QSPI hardware mode */
  uint8_t nbits;          /* Actual QSPI send/receive bits once transmission */

  uint8_t dummies;        /* Number of dummy cycles of command transfer */
  uint8_t addr_lines;     /* Number of address transmitting I/O pins */
  uint8_t data_lines;     /* Number of data transmitting I/O pins */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int esp32s3_qspi_lock(struct qspi_dev_s *dev, bool lock);
static uint32_t esp32s3_qspi_setfrequency(struct qspi_dev_s *dev,
                                          uint32_t frequency);
static void esp32s3_qspi_setmode(struct qspi_dev_s *dev,
                                 enum qspi_mode_e mode);
static void esp32s3_qspi_setbits(struct qspi_dev_s *dev, int nbits);
static int esp32s3_qspi_command(struct qspi_dev_s *dev,
                                struct qspi_cmdinfo_s *cmdinfo);
static int esp32s3_qspi_memory(struct qspi_dev_s *dev,
                               struct qspi_meminfo_s *meminfo);
static void *esp32s3_qspi_alloc(struct qspi_dev_s *dev, size_t buflen);
static void esp32s3_qspi_free(struct qspi_dev_s *dev, void *buffer);

#ifdef CONFIG_ESP32S3_SPI_DMA
static int esp32s3_qspi_interrupt(int irq, void *context, void *arg);
static int esp32s3_qspi_wait_sem(struct esp32s3_qspi_priv_s *priv);
static int esp32s3_qspi_init_dma(struct esp32s3_qspi_priv_s *priv);
#endif
static int esp32s3_qspi_init(struct esp32s3_qspi_priv_s *priv);
static void esp32s3_qspi_deinit(struct esp32s3_qspi_priv_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SPI2
static const struct esp32s3_qspi_config_s esp32s3_spi2_config =
{
  .id           = 2,

  .cs_pin       = CONFIG_ESP32S3_SPI2_CSPIN,
  .mosi_pin     = CONFIG_ESP32S3_SPI2_MOSIPIN,
  .miso_pin     = CONFIG_ESP32S3_SPI2_MISOPIN,
  .clk_pin      = CONFIG_ESP32S3_SPI2_CLKPIN,
  .io2_pin      = CONFIG_ESP32S3_SPI2_IO2PIN,
  .io3_pin      = CONFIG_ESP32S3_SPI2_IO3PIN,

  .periph       = ESP32S3_PERIPH_SPI2,
  .irq          = ESP32S3_IRQ_SPI2,

  .clk_bit      = SYSTEM_SPI2_CLK_EN,
  .rst_bit      = SYSTEM_SPI2_RST,

#ifdef CONFIG_ESP32S3_SPI_DMA
  .dma_periph   = ESP32S3_DMA_PERIPH_SPI2,
  .dma_clk_bit  = SYSTEM_SPI2_DMA_CLK_EN,
  .dma_rst_bit  = SYSTEM_SPI2_DMA_RST,
#endif

  .cs_insig     = FSPICS0_IN_IDX,
  .cs_outsig    = FSPICS0_OUT_IDX,
  .mosi_insig   = FSPID_IN_IDX,
  .mosi_outsig  = FSPID_OUT_IDX,
  .miso_insig   = FSPIQ_IN_IDX,
  .miso_outsig  = FSPIQ_OUT_IDX,
  .clk_insig    = FSPICLK_IN_IDX,
  .clk_outsig   = FSPICLK_OUT_IDX,
  .io2_insig    = FSPIWP_IN_IDX,
  .io2_outsig   = FSPIWP_OUT_IDX,
  .io3_insig    = FSPIHD_IN_IDX,
  .io3_outsig   = FSPIHD_OUT_IDX,
};

static const struct qspi_ops_s esp32s3_spi2_ops =
{
  .lock         = esp32s3_qspi_lock,
  .setfrequency = esp32s3_qspi_setfrequency,
  .setmode      = esp32s3_qspi_setmode,
  .setbits      = esp32s3_qspi_setbits,
#ifdef CONFIG_QSPI_HWFEATURES
  .hwfeatures   = NULL,
#endif
  .command      = esp32s3_qspi_command,
  .memory       = esp32s3_qspi_memory,
  .alloc        = esp32s3_qspi_alloc,
  .free         = esp32s3_qspi_free,
};

#  ifdef CONFIG_ESP32S3_SPI_DMA

/* QSPI 2 DMA RX/TX description */

static struct esp32s3_dmadesc_s esp32s3_spi2_dma_desc[QSPI_DMA_DESC_NUM];
#  endif

static struct esp32s3_qspi_priv_s esp32s3_spi2_priv =
{
  .spi_dev     =
    {
      .ops     = &esp32s3_spi2_ops
    },

  .config      = &esp32s3_spi2_config,

  .refs        = 0,
  .lock        = NXMUTEX_INITIALIZER,

#ifdef CONFIG_ESP32S3_SPI_DMA
  .sem_isr     = SEM_INITIALIZER(0),

  .cpu         = 0,
  .cpuint      = -ENOMEM,

  .dma_channel = -1,
  .dma_desc    = esp32s3_spi2_dma_desc,
#endif

  .frequency   = 0,
  .actual      = 0,
  .mode        = QSPIDEV_MODE0,
  .nbits       = 0,

  .dummies     = 0,
  .addr_lines  = 4,
  .data_lines  = 4,
};
#endif /* CONFIG_ESP32S3_SPI2 */

#ifdef CONFIG_ESP32S3_SPI3
static const struct esp32s3_qspi_config_s esp32s3_spi3_config =
{
  .id           = 3,

  .cs_pin       = CONFIG_ESP32S3_SPI3_CSPIN,
  .mosi_pin     = CONFIG_ESP32S3_SPI3_MOSIPIN,
  .miso_pin     = CONFIG_ESP32S3_SPI3_MISOPIN,
  .clk_pin      = CONFIG_ESP32S3_SPI3_CLKPIN,
  .io2_pin      = CONFIG_ESP32S3_SPI3_IO2PIN,
  .io3_pin      = CONFIG_ESP32S3_SPI3_IO3PIN,

  .periph       = ESP32S3_PERIPH_SPI3,
  .irq          = ESP32S3_IRQ_SPI3,

  .clk_bit      = SYSTEM_SPI3_CLK_EN,
  .rst_bit      = SYSTEM_SPI3_RST,

#ifdef CONFIG_ESP32S3_SPI_DMA
  .dma_periph   = ESP32S3_DMA_PERIPH_SPI3,
  .dma_clk_bit  = SYSTEM_SPI3_DMA_CLK_EN,
  .dma_rst_bit  = SYSTEM_SPI3_DMA_RST,
#endif

  .cs_insig     = SPI3_CS0_IN_IDX,
  .cs_outsig    = SPI3_CS0_OUT_IDX,
  .mosi_insig   = SPI3_D_IN_IDX,
  .mosi_outsig  = SPI3_D_OUT_IDX,
  .miso_insig   = SPI3_Q_IN_IDX,
  .miso_outsig  = SPI3_Q_OUT_IDX,
  .clk_insig    = SPI3_CLK_IN_IDX,
  .clk_outsig   = SPI3_CLK_OUT_IDX,
  .io2_insig    = SPI3_WP_IN_IDX,
  .io2_outsig   = SPI3_WP_OUT_IDX,
  .io3_insig    = SPI3_HD_IN_IDX,
  .io3_outsig   = SPI3_HD_OUT_IDX,
};

static const struct qspi_ops_s esp32s3_spi3_ops =
{
  .lock         = esp32s3_qspi_lock,
  .setfrequency = esp32s3_qspi_setfrequency,
  .setmode      = esp32s3_qspi_setmode,
  .setbits      = esp32s3_qspi_setbits,
#ifdef CONFIG_QSPI_HWFEATURES
  .hwfeatures   = NULL,
#endif
  .command      = esp32s3_qspi_command,
  .memory       = esp32s3_qspi_memory,
  .alloc        = esp32s3_qspi_alloc,
  .free         = esp32s3_qspi_free,
};

