apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_qspi.c
#  ifdef CONFIG_ESP32S3_SPI_DMA

/* QSPI 3 DMA description */

static struct esp32s3_dmadesc_s esp32s3_spi3_dma_desc[QSPI_DMA_DESC_NUM];
#  endif

static struct esp32s3_qspi_priv_s esp32s3_spi3_priv =
{
  .spi_dev     =
    {
      .ops     = &esp32s3_spi3_ops
    },

  .config      = &esp32s3_spi3_config,

  .refs        = 0,
  .lock        = NXMUTEX_INITIALIZER,

#ifdef CONFIG_ESP32S3_SPI_DMA
  .sem_isr     = SEM_INITIALIZER(0),

  .cpu         = 0,
  .cpuint      = -ENOMEM,

  .dma_channel = -1,
  .dma_desc    = esp32s3_spi3_dma_desc,
#endif

  .frequency   = 0,
  .actual      = 0,
  .mode        = QSPIDEV_MODE0,
  .nbits       = 0,

  .dummies     = 0,
  .addr_lines  = 4,
  .data_lines  = 4,
};
#endif /* CONFIG_ESP32S3_SPI3 */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s3_qspi_lock
 *
 * Description:
 *   Lock or unlock the QSPI device.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   lock - true: Lock QSPI bus, false: unlock QSPI bus
 *
 * Returned Value:
 *   The result of lock or unlock the QSPI device.
 *
 ****************************************************************************/

static int esp32s3_qspi_lock(struct qspi_dev_s *dev, bool lock)
{
  int ret;
  struct esp32s3_qspi_priv_s *priv = (struct esp32s3_qspi_priv_s *)dev;

  if (lock)
    {
      ret = nxmutex_lock(&priv->lock);
    }
  else
    {
      ret = nxmutex_unlock(&priv->lock);
    }

  return ret;
}

/****************************************************************************
 * Name: esp32s3_qspi_setfrequency
 *
 * Description:
 *   Set the QSPI frequency.
 *
 * Input Parameters:
 *   dev       - Device-specific state data
 *   frequency - The requested QSPI frequency
 *
 * Returned Value:
 *   Returns the current selected frequency.
 *
 ****************************************************************************/

static uint32_t esp32s3_qspi_setfrequency(struct qspi_dev_s *dev,
                                          uint32_t frequency)
{
  uint32_t regval;
  struct esp32s3_qspi_priv_s *priv = (struct esp32s3_qspi_priv_s *)dev;
  const uint32_t duty_cycle = 128;

  if (priv->frequency == frequency)
    {
      /* Requested frequency is the same as the current frequency. */

      return priv->actual;
    }

  /* In HW, n, h and l fields range from 1 to 64, pre ranges from 1 to 8K.
   * The value written to register is one lower than the used value.
   */

  if (frequency > ((APB_CLK_FREQ / 4) * 3))
    {
      /* Using APB frequency directly will give us the best result here. */

      regval = SPI_CLK_EQU_SYSCLK_M;
      priv->actual = APB_CLK_FREQ;
    }
  else
    {
      /* For best duty cycle resolution, we want n to be as close to 32 as
       * possible, but we also need a pre/n combo that gets us as close as
       * possible to the intended frequency. To do this, we bruteforce n and
       * calculate the best pre to go along with that. If there's a choice
       * between pre/n combos that give the same result, use the one with the
       * higher n.
       */

      int32_t pre;
      int32_t n;
      int32_t h;
      int32_t l;
      int32_t bestn = -1;
      int32_t bestpre = -1;
      int32_t besterr = 0;
      int32_t errval;

      /* Start at n = 2. We need to be able to set h/l so we have at least
       * one high and one low pulse.
       */

      for (n = 2; n <= 64; n++)
        {
          /* Effectively, this does:
           *   pre = round((APB_CLK_FREQ / n) / frequency)
           */

          pre = ((APB_CLK_FREQ / n) + (frequency / 2)) / frequency;

          if (pre <= 0)
            {
              pre = 1;
            }

          if (pre > 16)
            {
              pre = 16;
            }

          errval = abs(APB_CLK_FREQ / (pre * n) - frequency);
          if (bestn == -1 || errval <= besterr)
            {
              besterr = errval;
              bestn = n;
              bestpre = pre;
            }
        }

      n = bestn;
      pre = bestpre;
      l = n;

      /* Effectively, this does:
       *   h = round((duty_cycle * n) / 256)
       */

      h = (duty_cycle * n + 127) / 256;
      if (h <= 0)
        {
          h = 1;
        }

      regval = ((l - 1) << SPI_CLKCNT_L_S) |
               ((h - 1) << SPI_CLKCNT_H_S) |
               ((n - 1) << SPI_CLKCNT_N_S) |
               ((pre - 1) << SPI_CLKDIV_PRE_S);

      priv->actual = APB_CLK_FREQ / (n * pre);
    }

  priv->frequency = frequency;

  putreg32(regval, SPI_CLOCK_REG(priv->config->id));

  spiinfo("frequency=%" PRIu32 ", actual=%" PRIu32 "\n",
          priv->frequency, priv->actual);

  return priv->actual;
}

/****************************************************************************
 * Name:  esp32s3_qspi_setmode
 *
 * Description:
 *   Set the QSPI mode.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   mode - The requested QSPI mode
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32s3_qspi_setmode(struct qspi_dev_s *dev,
                                 enum qspi_mode_e mode)
{
  uint32_t regval;
  struct esp32s3_qspi_priv_s *priv = (struct esp32s3_qspi_priv_s *)dev;
  uint8_t id = priv->config->id;

  spiinfo("mode=%d\n", mode);

  /* Has the mode changed? */

  if (mode != priv->mode)
    {
      uint32_t ck_idle_edge;
      uint32_t ck_out_edge;

      switch (mode)
        {
          case QSPIDEV_MODE0: /* CPOL=0; CPHA=0 */
            ck_idle_edge = 0;
            ck_out_edge = 0;
            break;

          case QSPIDEV_MODE1: /* CPOL=0; CPHA=1 */
            ck_idle_edge = 0;
            ck_out_edge = 1;
            break;

          case QSPIDEV_MODE2: /* CPOL=1; CPHA=0 */
            ck_idle_edge = 1;
            ck_out_edge = 1;
            break;

          case QSPIDEV_MODE3: /* CPOL=1; CPHA=1 */
            ck_idle_edge = 1;
            ck_out_edge = 0;
            break;

          default:
            spierr("Invalid mode: %d\n", mode);
            DEBUGPANIC();
            return;
        }

      regval  = getreg32(SPI_MISC_REG(id));
      regval &= SPI_CK_IDLE_EDGE_M;
      regval |= ck_idle_edge << SPI_CK_IDLE_EDGE_S;
      putreg32(regval, SPI_MISC_REG(id));

      regval  = getreg32(SPI_USER_REG(id));
      regval &= SPI_CK_OUT_EDGE_M;
      regval |= ck_out_edge << SPI_CK_OUT_EDGE_S;
      putreg32(regval, SPI_USER_REG(id));

      priv->mode = mode;
    }
}

/****************************************************************************
 * Name: esp32s3_qspi_setbits
 *
 * Description:
 *   Set the number of bits per word.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   nbits - The number of bits in an QSPI word.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

