apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_qspi.c
static void esp32s3_qspi_setbits(struct qspi_dev_s *dev, int nbits)
{
  struct esp32s3_qspi_priv_s *priv = (struct esp32s3_qspi_priv_s *)dev;

  spiinfo("nbits=%d\n", nbits);

  priv->nbits = nbits;
}

/****************************************************************************
 * Name: esp32s3_qspi_command
 *
 * Description:
 *   Perform one QSPI data transfer
 *
 * Input Parameters:
 *   dev     - Device-specific state data
 *   cmdinfo - Describes the command transfer to be performed.
 *
 * Returned Value:
 *   Zero (OK) on SUCCESS, a negated errno on value of failure
 *
 ****************************************************************************/

static int esp32s3_qspi_command(struct qspi_dev_s *dev,
                                struct qspi_cmdinfo_s *cmdinfo)
{
  uint32_t regval;
  uint8_t *data;
  struct esp32s3_qspi_priv_s *priv = (struct esp32s3_qspi_priv_s *)dev;
  uint8_t id = priv->config->id;
  uint32_t user1_reg = getreg32(SPI_USER1_REG(id));
  uint32_t user_reg = getreg32(SPI_USER_REG(id));

  if (QSPICMD_ISWRITE(cmdinfo->flags) || QSPICMD_ISREAD(cmdinfo->flags))
    {
      if (cmdinfo->buflen > QSPI_CMD_BUFSIZE)
        {
          return -EINVAL;
        }
      else
        {
          putreg32(cmdinfo->buflen * 8 - 1, SPI_MS_DLEN_REG(id));
        }
    }

  /* Initialize QSPI user register */

#ifdef CONFIG_ESP32S3_SPI_DMA

  /* Disable QSPI DMA */

  regval  = getreg32(SPI_DMA_CONF_REG(id));
  regval &= ~(SPI_DMA_TX_ENA_M | SPI_DMA_RX_ENA_M);
  putreg32(regval, SPI_DMA_CONF_REG(id));

  putreg32(0, SPI_DMA_INT_ENA_REG(id));
#endif

  user_reg &= ~(SPI_USR_ADDR_M |
                SPI_USR_MOSI_M |
                SPI_USR_MISO_M |
                SPI_USR_DUMMY_M |
                SPI_FWRITE_DUAL_M |
                SPI_FWRITE_OCT_M |
                SPI_FWRITE_QUAD_M);
  user_reg |= SPI_USR_COMMAND_M;

  /* Set command bits and value, and command is always needed */

  regval  = getreg32(SPI_USER2_REG(id));
  regval &= ~(SPI_USR_COMMAND_BITLEN_M |
              SPI_USR_COMMAND_VALUE_M |
              SPI_MST_REMPTY_ERR_END_EN_M);
  regval |= ((QSPI_CMD_BITS(cmdinfo->cmd) - 1) << SPI_USR_COMMAND_BITLEN_S) |
            (cmdinfo->cmd << SPI_USR_COMMAND_VALUE_S);
  putreg32(regval, SPI_USER2_REG(id));

  /* Set address bits and value */

  if (QSPICMD_ISADDRESS(cmdinfo->flags))
    {
      user1_reg &= ~SPI_USR_ADDR_BITLEN_M;
      user1_reg |= (cmdinfo->addrlen * 8 - 1) << SPI_USR_ADDR_BITLEN_S;

      user_reg |= SPI_USR_ADDR_M;

      regval = cmdinfo->addr << (32 - cmdinfo->addrlen * 8);
      putreg32(regval, SPI_ADDR_REG(id));
    }

  /* Set dummy */

  if (priv->dummies)
    {
      user1_reg &= ~SPI_USR_DUMMY_CYCLELEN_M;
      user1_reg |= (priv->dummies - 1) << SPI_USR_DUMMY_CYCLELEN_S;

      user_reg |= SPI_USR_DUMMY_M;
    }

  /* Set TX data */

  if (QSPICMD_ISWRITE(cmdinfo->flags))
    {
      data = (uint8_t *)cmdinfo->buffer;

      for (int i = 0; i < cmdinfo->buflen; i += 4)
        {
          memcpy(&regval, data + i, 4);
          putreg32(regval, SPI_W0_REG(id) + i);
        }

      user_reg |= SPI_USR_MOSI_M;

      if (priv->data_lines == 2)
        {
          user_reg |= SPI_FWRITE_DUAL_M;
        }
      else if (priv->data_lines == 4)
        {
          user_reg |= SPI_FWRITE_QUAD_M;
        }
    }
  else if (QSPICMD_ISREAD(cmdinfo->flags))
    {
      user_reg |= SPI_USR_MISO_M;
    }

  putreg32(user_reg,  SPI_USER_REG(id));
  putreg32(user1_reg, SPI_USER1_REG(id));

  /* Set command and address I/O mode */

  regval  = getreg32(SPI_CTRL_REG(id));
  regval &= ~(SPI_FCMD_OCT_M | SPI_FADDR_OCT_M | SPI_FREAD_OCT_M |
              SPI_FCMD_DUAL_M | SPI_FADDR_DUAL_M | SPI_FREAD_DUAL_M |
              SPI_FCMD_QUAD_M | SPI_FADDR_QUAD_M | SPI_FREAD_QUAD_M);
  if (QSPICMD_ISIDUAL(cmdinfo->flags))
    {
      regval |= SPI_FCMD_DUAL_M;
    }
  else if (QSPICMD_ISIQUAD(cmdinfo->flags))
    {
      regval |= SPI_FCMD_QUAD_M;
    }

  if (priv->addr_lines == 2)
    {
      regval |= SPI_FADDR_DUAL_M;
    }
  else if (priv->addr_lines == 4)
    {
      regval |= SPI_FADDR_QUAD_M;
    }

  if (QSPICMD_ISREAD(cmdinfo->flags))
    {
      if (priv->data_lines == 2)
        {
          regval |= SPI_FREAD_DUAL_M;
        }
      else if (priv->data_lines == 4)
        {
          regval |= SPI_FREAD_QUAD_M;
        }
    }

  putreg32(regval, SPI_CTRL_REG(id));

  /* Update QSPI master registers value */

  regval = getreg32(SPI_CMD_REG(id));
  regval |= SPI_UPDATE_M;
  putreg32(regval, SPI_CMD_REG(id));

  while ((getreg32(SPI_CMD_REG(id)) & SPI_UPDATE_M) != 0)
    {
      ;
    }

  /* Start transmission */

  regval = getreg32(SPI_CMD_REG(id));
  regval |= SPI_USR_M;
  putreg32(regval, SPI_CMD_REG(id));

  /* Wait until transmission is done */

  while ((getreg32(SPI_CMD_REG(id)) & SPI_USR_M) != 0)
    {
      ;
    }

  if (QSPICMD_ISREAD(cmdinfo->flags))
    {
      data = (uint8_t *)cmdinfo->buffer;

      for (int i = 0; i < cmdinfo->buflen; i += 4)
        {
          regval = getreg32(SPI_W0_REG(id) + i);
          memcpy(data + i, &regval, MIN(4, cmdinfo->buflen - i));
        }
    }

  return OK;
}

/****************************************************************************
 * Name: esp32s3_qspi_memory
 *
 * Description:
 *   Perform one QSPI memory transfer
 *
 * Input Parameters:
 *   dev     - Device-specific state data
 *   meminfo - Describes the memory transfer to be performed.
 *
 * Returned Value:
 *   Zero (OK) on SUCCESS, a negated errno on value of failure
 *
 ****************************************************************************/

static int esp32s3_qspi_memory(struct qspi_dev_s *dev,
                               struct qspi_meminfo_s *meminfo)
{
#ifdef CONFIG_ESP32S3_SPI_DMA
  uint32_t regval;
  struct esp32s3_qspi_priv_s *priv = (struct esp32s3_qspi_priv_s *)dev;
  uint8_t id = priv->config->id;
  uint32_t user1_reg = getreg32(SPI_USER1_REG(id));
  uint32_t user_reg = getreg32(SPI_USER_REG(id));

  if (QSPIMEM_ISWRITE(meminfo->flags) || QSPIMEM_ISREAD(meminfo->flags))
    {
      if (meminfo->buflen > QSPI_DMA_BUFSIZE)
        {
          return -EINVAL;
        }
      else
        {
          putreg32(meminfo->buflen * 8 - 1, SPI_MS_DLEN_REG(id));
        }
    }

  /* Reset SPI DMA FIFO */

  regval  = getreg32(SPI_DMA_CONF_REG(id));
  regval |= QSPI_DMA_RESET_MASK;
  putreg32(regval, SPI_DMA_CONF_REG(id));

