apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_qspi.c
  regval &= ~QSPI_DMA_RESET_MASK;
  putreg32(regval, SPI_DMA_CONF_REG(id));

  /* Initialize QSPI user register */

  user_reg &= ~(SPI_USR_MOSI_M |
                SPI_USR_MISO_M |
                SPI_USR_DUMMY_M |
                SPI_FWRITE_DUAL_M |
                SPI_FWRITE_OCT_M |
                SPI_FWRITE_QUAD_M);
  user_reg |= SPI_USR_COMMAND_M;

  /* Set command bits and value, and command is always needed */

  regval  = getreg32(SPI_USER2_REG(id));
  regval &= ~(SPI_USR_COMMAND_BITLEN_M |
              SPI_USR_COMMAND_VALUE_M |
              SPI_MST_REMPTY_ERR_END_EN_M);
  regval |= ((QSPI_CMD_BITS(meminfo->cmd) - 1) << SPI_USR_COMMAND_BITLEN_S) |
            (meminfo->cmd << SPI_USR_COMMAND_VALUE_S);
  putreg32(regval, SPI_USER2_REG(id));

  /* Set address bits and value */

  if (meminfo->addrlen)
    {
      user_reg |= SPI_USR_ADDR_M;

      user1_reg &= ~SPI_USR_ADDR_BITLEN_M;
      user1_reg |= (meminfo->addrlen * 8 - 1) << SPI_USR_ADDR_BITLEN_S;

      regval = meminfo->addr << (32 - meminfo->addrlen * 8);
      putreg32(regval, SPI_ADDR_REG(id));
    }

  /* Set dummy */

  if (meminfo->dummies)
    {
      user1_reg &= ~SPI_USR_DUMMY_CYCLELEN_M;
      user1_reg |= (meminfo->dummies - 1) << SPI_USR_DUMMY_CYCLELEN_S;

      user_reg |= SPI_USR_DUMMY_M;
    }

  /* Enable SPI DMA TX */

  if (QSPIMEM_ISWRITE(meminfo->flags))
    {
      regval  = getreg32(SPI_DMA_CONF_REG(id));
      regval |= SPI_DMA_TX_ENA_M;
      putreg32(regval, SPI_DMA_CONF_REG(id));

      user_reg |= SPI_USR_MOSI_M;

      if (priv->data_lines == 2)
        {
          user_reg |= SPI_FWRITE_DUAL_M;
        }
      else if (priv->data_lines == 4)
        {
          user_reg |= SPI_FWRITE_QUAD_M;
        }

      esp32s3_dma_setup(priv->dma_desc,
                        QSPI_DMA_DESC_NUM,
                        (uint8_t *)meminfo->buffer,
                        meminfo->buflen,
                        true, priv->dma_channel);
      esp32s3_dma_load(priv->dma_desc, priv->dma_channel, true);
      esp32s3_dma_enable(priv->dma_channel, true);
    }
  else if (QSPIMEM_ISREAD(meminfo->flags))
    {
      regval  = getreg32(SPI_DMA_CONF_REG(id));
      regval |= SPI_DMA_RX_ENA_M;
      putreg32(regval, SPI_DMA_CONF_REG(id));

      user_reg |= SPI_USR_MISO_M;

      esp32s3_dma_setup(priv->dma_desc,
                        QSPI_DMA_DESC_NUM,
                        (uint8_t *)meminfo->buffer,
                        meminfo->buflen,
                        false, priv->dma_channel);
      esp32s3_dma_load(priv->dma_desc, priv->dma_channel, false);
      esp32s3_dma_enable(priv->dma_channel, false);
    }

  putreg32(user_reg,  SPI_USER_REG(id));
  putreg32(user1_reg, SPI_USER1_REG(id));

  /* Set command and address I/O mode */

  regval  = getreg32(SPI_CTRL_REG(id));
  regval &= ~(SPI_FCMD_OCT_M | SPI_FADDR_OCT_M | SPI_FREAD_OCT_M |
              SPI_FCMD_DUAL_M | SPI_FADDR_DUAL_M | SPI_FREAD_DUAL_M |
              SPI_FCMD_QUAD_M | SPI_FADDR_QUAD_M | SPI_FREAD_QUAD_M);
  if (QSPIMEM_ISIDUAL(meminfo->flags))
    {
      regval |= SPI_FCMD_DUAL_M;
    }
  else if (QSPIMEM_ISIQUAD(meminfo->flags))
    {
      regval |= SPI_FCMD_QUAD_M;
    }

  if (priv->addr_lines == 2)
    {
      regval |= SPI_FADDR_DUAL_M;
    }
  else if (priv->addr_lines == 4)
    {
      regval |= SPI_FADDR_QUAD_M;
    }

  if (QSPIMEM_ISREAD(meminfo->flags))
    {
      if (priv->data_lines == 2)
        {
          regval |= SPI_FREAD_DUAL_M;
        }
      else if (priv->data_lines == 4)
        {
          regval |= SPI_FREAD_QUAD_M;
        }
    }

  putreg32(regval, SPI_CTRL_REG(id));

  /* Set interrupt */

  putreg32(SPI_TRANS_DONE_INT_CLR_M, SPI_DMA_INT_CLR_REG(id));
  putreg32(SPI_TRANS_DONE_INT_ENA_M, SPI_DMA_INT_ENA_REG(id));

  /* Update QSPI master registers value */

  regval = getreg32(SPI_CMD_REG(id));
  regval |= SPI_UPDATE_M;
  putreg32(regval, SPI_CMD_REG(id));

  while ((getreg32(SPI_CMD_REG(id)) & SPI_UPDATE_M) != 0)
    {
      ;
    }

  /* Start transmission */

  regval = getreg32(SPI_CMD_REG(id));
  regval |= SPI_USR_M;
  putreg32(regval, SPI_CMD_REG(id));

  /* Wait for transmission done */

  esp32s3_qspi_wait_sem(priv);

  /* Reset interrupt */

  putreg32(0, SPI_DMA_INT_ENA_REG(id));

  return 0;
#else
  return -1;
#endif
}

/****************************************************************************
 * Name: esp32s3_qspi_alloc
 *
 * Description:
 *   Allocate a buffer suitable for DMA data transfer
 *
 * Input Parameters:
 *   dev    - Device-specific state data
 *   buflen - Buffer length to allocate in bytes
 *
 * Returned Value:
 *   Address of the allocated memory on success; NULL is returned on any
 *   failure.
 *
 ****************************************************************************/

static void *esp32s3_qspi_alloc(struct qspi_dev_s *dev, size_t buflen)
{
#ifdef CONFIG_ESP32S3_SPI_DMA
  return kmm_malloc(ALIGN_UP(buflen, 4));
#else
  return NULL;
#endif
}

/****************************************************************************
 * Name: esp32s3_qspi_free
 *
 * Description:
 *   Free memory returned by QSPI_ALLOC
 *
 * Input Parameters:
 *   dev    - Device-specific state data
 *   buffer - Buffer previously allocated via QSPI_ALLOC
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32s3_qspi_free(struct qspi_dev_s *dev, void *buffer)
{
#ifdef CONFIG_ESP32S3_SPI_DMA
  if (buffer)
    {
      kmm_free(buffer);
    }
#endif
}

/****************************************************************************
 * Name:  esp32s3_qspi_wait_sem
 *
 * Description:
 *   Wait for a transfer to complete.
 *
 * Input Parameters:
 *   priv - QSPI private state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SPI_DMA
static int esp32s3_qspi_wait_sem(struct esp32s3_qspi_priv_s *priv)
{
  return nxsem_tickwait_uninterruptible(&priv->sem_isr, SEC2TICK(10));
}
#endif

/****************************************************************************
 * Name: esp32s3_qspi_init_dma
 *
 * Description:
 *   Initialize ESP32-S3 QSPI connection to GDMA engine.
 *
 * Input Parameters:
 *   priv - QSPI private state data
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

