apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_qspi.c
#ifdef CONFIG_ESP32S3_SPI_DMA
static int esp32s3_qspi_init_dma(struct esp32s3_qspi_priv_s *priv)
{
  const struct esp32s3_qspi_config_s *config = priv->config;

  /* Enable GDMA clock for the QSPI peripheral */

  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, 0, config->dma_clk_bit);

  /* Reset GDMA for the QSPI peripheral */

  modifyreg32(SYSTEM_PERIP_RST_EN0_REG, config->dma_rst_bit, 0);

  /* Request a GDMA channel for QSPI peripheral */

  priv->dma_channel = esp32s3_dma_request(config->dma_periph, 1, 1, true);
  if (priv->dma_channel < 0)
    {
      spierr("Failed to allocate GDMA channel\n");
      return ERROR;
    }

  /* Disable segment transaction mode for QSPI Master */

  putreg32((SPI_SLV_RX_SEG_TRANS_CLR_EN_M | SPI_SLV_TX_SEG_TRANS_CLR_EN_M),
           SPI_DMA_CONF_REG(config->id));

  return OK;
}

/****************************************************************************
 * Name: esp32s3_qspi_dma_deinit
 *
 * Description:
 *   Deinitialize ESP32-S3 QSPI GDMA engine.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32s3_qspi_dma_deinit(struct esp32s3_qspi_priv_s *priv)
{
  /* Release a DMA channel from peripheral */

  esp32s3_dma_release(priv->dma_channel);

  /* Disable DMA clock for the SPI peripheral */

  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, priv->config->dma_clk_bit, 0);
}

#endif

/****************************************************************************
 * Name: esp32s3_qspi_init_iomux
 *
 * Description:
 *   Initialize ESP32-S3 QSPI GPIO by IO MUX.
 *
 * Input Parameters:
 *   priv - QSPI private state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#if QSPI_VIA_IOMUX != 0
static void esp32s3_qspi_init_iomux(struct esp32s3_qspi_priv_s *priv)
{
  uint32_t attr = OUTPUT_FUNCTION_5;
  const struct esp32s3_qspi_config_s *config = priv->config;

  esp_configgpio(config->cs_pin,  attr);
  esp_configgpio(config->clk_pin, attr);

  attr |= INPUT;

  esp_configgpio(config->mosi_pin, attr);
  esp_configgpio(config->miso_pin, attr);
  esp_configgpio(config->io2_pin,  attr);
  esp_configgpio(config->io3_pin,  attr);

  esp_gpio_matrix_out(config->cs_pin,   SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->clk_pin,  SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->mosi_pin, SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->miso_pin, SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->io2_pin,  SIG_GPIO_OUT_IDX, 0, 0);
  esp_gpio_matrix_out(config->io3_pin,  SIG_GPIO_OUT_IDX, 0, 0);
}
#endif

/****************************************************************************
 * Name: esp32s3_qspi_init_iomatrix
 *
 * Description:
 *   Initialize ESP32-S3 QSPI GPIO by IO matrix.
 *
 * Input Parameters:
 *   priv - QSPI private state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#if QSPI_VIA_IOMUX == 0 || defined(CONFIG_ESP32S3_SPI3)
static void esp32s3_qspi_init_iomatrix(struct esp32s3_qspi_priv_s *priv)
{
  uint32_t attr = OUTPUT;
  const struct esp32s3_qspi_config_s *config = priv->config;

  esp_configgpio(config->cs_pin, OUTPUT);
  esp_gpio_matrix_out(config->cs_pin, config->cs_outsig, 0, 0);

  esp_configgpio(config->clk_pin, OUTPUT);
  esp_gpio_matrix_out(config->clk_pin, config->clk_outsig, 0, 0);

  attr |= INPUT;

  esp_configgpio(config->mosi_pin, attr);
  esp_gpio_matrix_in(config->mosi_pin, config->mosi_insig, 0);
  esp_gpio_matrix_out(config->mosi_pin, config->mosi_outsig, 0, 0);

  esp_configgpio(config->miso_pin, attr);
  esp_gpio_matrix_in(config->miso_pin, config->miso_insig, 0);
  esp_gpio_matrix_out(config->miso_pin, config->miso_outsig, 0, 0);

  esp_configgpio(config->io2_pin, attr);
  esp_gpio_matrix_in(config->io2_pin, config->io2_insig, 0);
  esp_gpio_matrix_out(config->io2_pin, config->io2_outsig, 0, 0);

  esp_configgpio(config->io3_pin, attr);
  esp_gpio_matrix_in(config->io3_pin, config->io3_insig, 0);
  esp_gpio_matrix_out(config->io3_pin, config->io3_outsig, 0, 0);
}
#endif

/****************************************************************************
 * Name: esp32s3_qspi_init_gpio
 *
 * Description:
 *   Initialize ESP32-S3 QSPI GPIO
 *
 * Input Parameters:
 *   priv - QSPI private state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32s3_qspi_init_gpio(struct esp32s3_qspi_priv_s *priv)
{
  /* SPI3 doesn't have IOMUX  */

#if QSPI_VIA_IOMUX != 0
  if (priv->config->id == 2)
    {
      esp32s3_qspi_init_iomux(priv);
    }
#ifdef CONFIG_ESP32S3_SPI3
  else
    {
      esp32s3_qspi_init_iomatrix(priv);
    }
#endif
#else
  esp32s3_qspi_init_iomatrix(priv);
#endif
}

/****************************************************************************
 * Name: esp32s3_qspi_init
 *
 * Description:
 *   Initialize ESP32-S3 QSPI hardware interface.
 *
 * Input Parameters:
 *   priv - QSPI private state data
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int esp32s3_qspi_init(struct esp32s3_qspi_priv_s *priv)
{
  const struct esp32s3_qspi_config_s *config = priv->config;
  uint8_t id = config->id;

  esp32s3_qspi_init_gpio(priv);

  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, 0, config->clk_bit);
  modifyreg32(SYSTEM_PERIP_RST_EN0_REG, config->rst_bit, 0);

  putreg32(SPI_USR_MOSI_M | SPI_CS_HOLD_M, SPI_USER_REG(id));

  putreg32(0, SPI_USER1_REG(id));
  putreg32(0, SPI_SLAVE_REG(id));
  putreg32(SPI_CS1_DIS_M | SPI_CS2_DIS_M, SPI_MISC_REG(id));

  putreg32(SPI_CLK_EN_M | SPI_MST_CLK_ACTIVE_M | SPI_MST_CLK_SEL_M,
           SPI_CLK_GATE_REG(id));

  putreg32(0, SPI_CTRL_REG(id));

#ifdef CONFIG_ESP32S3_SPI_DMA
  if (esp32s3_qspi_init_dma(priv) != OK)
    {
      modifyreg32(SYSTEM_PERIP_RST_EN0_REG, 0, priv->config->clk_bit);
      modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, priv->config->clk_bit, 0);
      return ERROR;
    }
#endif

