apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_qspi.c
  esp32s3_qspi_setfrequency(&priv->spi_dev, QSPI_DEFAULT_FREQ);
  esp32s3_qspi_setbits(&priv->spi_dev, QSPI_DEFAULT_WIDTH);
  esp32s3_qspi_setmode(&priv->spi_dev, QSPI_DEFAULT_MODE);

  return OK;
}

/****************************************************************************
 * Name: esp32s3_qspi_deinit
 *
 * Description:
 *   Deinitialize ESP32-S3 QSPI hardware interface.
 *
 * Input Parameters:
 *   priv - QSPI private state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32s3_qspi_deinit(struct esp32s3_qspi_priv_s *priv)
{
  const struct esp32s3_qspi_config_s *config = priv->config;

#ifdef CONFIG_ESP32S3_SPI_DMA
  esp32s3_qspi_dma_deinit(priv);
#endif

  modifyreg32(SYSTEM_PERIP_RST_EN0_REG, 0, config->rst_bit);
  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, config->clk_bit, 0);

  priv->frequency  = 0;
  priv->actual     = 0;
  priv->mode       = QSPIDEV_MODE0;
  priv->nbits      = 0;
  priv->dummies    = 0;
  priv->addr_lines = 4;
  priv->data_lines = 4;
}

/****************************************************************************
 * Name: esp32s3_qspi_interrupt
 *
 * Description:
 *   Common QSPI DMA interrupt handler.
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info
 *   arg     - QSPI controller private data
 *
 * Returned Value:
 *   Standard interrupt return value.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SPI_DMA
static int esp32s3_qspi_interrupt(int irq, void *context, void *arg)
{
  struct esp32s3_qspi_priv_s *priv = (struct esp32s3_qspi_priv_s *)arg;

  /* Write 1 to clear interrupt bit */

  putreg32(SPI_TRANS_DONE_INT_CLR_M, SPI_DMA_INT_CLR_REG(priv->config->id));

  nxsem_post(&priv->sem_isr);

  return 0;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s3_qspibus_set_attr
 *
 * Description:
 *   Set attribution of QSPI bus transfer.
 *
 * Input Parameters:
 *   dev        - Device-specific state data
 *   dummies    - Number of dummy cycles, this only works in command
 *                transfer, not works in memory transfer
 *   addr_lines - Number of address transmitting I/O pins
 *   data_lines - Number of data transmitting I/O pins
 *
 * Returned Value:
 *   Zero (OK) is returned on success.  Otherwise -1 (ERROR).
 *
 ****************************************************************************/

int esp32s3_qspibus_set_attr(struct qspi_dev_s *dev,
                             uint8_t dummies,
                             uint8_t addr_lines,
                             uint8_t data_lines)
{
  struct esp32s3_qspi_priv_s *priv = (struct esp32s3_qspi_priv_s *)dev;

  DEBUGASSERT(dev);

  if (priv->refs == 0)
    {
      return ERROR;
    }

  if ((addr_lines != 1) &&
      (addr_lines != 2) &&
      (addr_lines != 4))
    {
      return ERROR;
    }

  if ((data_lines != 1) &&
      (data_lines != 2) &&
      (data_lines != 4))
    {
      return ERROR;
    }

  priv->dummies = dummies;
  priv->addr_lines = addr_lines;
  priv->data_lines = data_lines;

  return OK;
}

/****************************************************************************
 * Name: esp32s3_qspibus_set_delay
 *
 * Description:
 *   Set timing delay for QSPI input and output data.
 *
 * Input Parameters:
 *   dev        - Device-specific state data
 *   din_mode   - Input mode(0~3) to delay input data
 *   din_num    - The delay number(0~3) to input data
 *   dout_mode  - Output mode(0,1) to delay output data
 *
 * Returned Value:
 *   Zero (OK) is returned on success.  Otherwise -1 (ERROR).
 *
 ****************************************************************************/

int esp32s3_qspibus_set_delay(struct qspi_dev_s *dev,
                              uint8_t din_mode,
                              uint8_t din_num,
                              uint8_t dout_mode)
{
  struct esp32s3_qspi_priv_s *priv = (struct esp32s3_qspi_priv_s *)dev;
  uint8_t id = priv->config->id;

  if ((din_mode > 3) || (din_num > 3) || (dout_mode > 1))
    {
      return -1;
    }

  uint32_t din_mode_reg = (din_mode << SPI_DIN0_MODE_S) |
                          (din_mode << SPI_DIN1_MODE_S) |
                          (din_mode << SPI_DIN2_MODE_S) |
                          (din_mode << SPI_DIN3_MODE_S);
  uint32_t din_num_reg = (din_num << SPI_DIN0_NUM_S) |
                         (din_num << SPI_DIN1_NUM_S) |
                         (din_num << SPI_DIN2_NUM_S) |
                         (din_num << SPI_DIN3_NUM_S);
  uint32_t dout_mode_reg = (dout_mode << SPI_DOUT0_MODE_S) |
                           (dout_mode << SPI_DOUT1_MODE_S) |
                           (dout_mode << SPI_DOUT2_MODE_S) |
                           (dout_mode << SPI_DOUT3_MODE_S);

  putreg32(din_mode_reg, SPI_DIN_MODE_REG(id));
  putreg32(din_num_reg, SPI_DIN_NUM_REG(id));
  putreg32(dout_mode_reg, SPI_DOUT_MODE_REG(id));

  return 0;
}

/****************************************************************************
 * Name: esp32s3_qspibus_initialize
 *
 * Description:
 *   Initialize the selected QSPI bus.
 *
 * Input Parameters:
 *   port - Port number (for hardware that has multiple QSPI interfaces)
 *
 * Returned Value:
 *   Valid QSPI device structure reference on success; NULL on failure.
 *
 ****************************************************************************/

struct qspi_dev_s *esp32s3_qspibus_initialize(int port)
{
  struct qspi_dev_s *spi_dev;
  struct esp32s3_qspi_priv_s *priv;

  switch (port)
    {
#ifdef CONFIG_ESP32S3_SPI2
      case ESP32S3_SPI2:
        priv = &esp32s3_spi2_priv;
        break;
#endif
#ifdef CONFIG_ESP32S3_SPI3
      case ESP32S3_SPI3:
        priv = &esp32s3_spi3_priv;
        break;
#endif
      default:
        return NULL;
    }

  spi_dev = (struct qspi_dev_s *)priv;

  nxmutex_lock(&priv->lock);
  if (priv->refs != 0)
    {
      priv->refs++;
      nxmutex_unlock(&priv->lock);
      return spi_dev;
    }

